## Pandas Basic 3

In [1]:
from IPython.display import Image

from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 3. Summarizing and computing descriptive statistics
기술통계 계산과 요약

- pandas 객체는 일반적인 수학 메소드와 통계 메소드를 가지고 있다.
- 대부분 Series나 DataFrame 하나의 칼럼이나 로우에서 단일 값(합이나 평균같은)을 구하는 축소 혹은 요약통계 범주
- 순수 NumPy 배열에서 제공하는 동일한 메소드와 비교하여 pandas의 메소드는 처음부터 누락된 데이터를 제외하도록 설계되었다.

In [2]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['eins', 'zwei'])
df

   eins  zwei
a  1.40   NaN
b  7.10  -4.5
c   NaN   NaN
d  0.75  -1.3

In [3]:
df.sum()

eins    9.25
zwei   -5.80
dtype: float64

In [4]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [5]:
# skinpa : 누락된 값을 제외할 것인가를 정하는 옵션
df.mean(axis=1, skipna=False)
#1개만 null이여도 NaN 값 return

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [6]:
df.mean(axis=1, skipna=True)
#2개 다 null 값이어야지 Nan return 한다.

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [7]:
df

   eins  zwei
a  1.40   NaN
b  7.10  -4.5
c   NaN   NaN
d  0.75  -1.3

In [8]:
df.idxmax()
#각 행에서 가장 큰 숫자를 가진 index 값 반환

eins    b
zwei    d
dtype: object

In [9]:
df.cumsum()
#1.4/1.4+7.1/...

   eins  zwei
a  1.40   NaN
b  8.50  -4.5
c   NaN   NaN
d  9.25  -5.8

In [10]:
# 한번에 통계 결과를 여러개 만들어 내는 함수
df.describe()

           eins      zwei
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [11]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [12]:
['a', 'a', 'b', 'c'] * 3

['a', 'a', 'b', 'c', 'a', 'a', 'b', 'c', 'a', 'a', 'b', 'c']

### Unique values, value counts, and membership 
유일 값, 값 세기, 멤버십

In [13]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [14]:
uniques = obj.unique()
uniques
#value 아무리 많아도 같으면 1개로 return

array(['c', 'a', 'd', 'b'], dtype=object)

In [15]:
obj.value_counts()
#순서는 재멋대로

a    3
c    3
b    2
d    1
dtype: int64

In [16]:
pd.value_counts(obj.values, sort=False)

b    2
c    3
a    3
d    1
dtype: int64

In [17]:
pd.value_counts(obj.values, sort=True)

a    3
c    3
b    2
d    1
dtype: int64

In [18]:
mask = obj.isin(['b', 'c'])
mask
#위에 series에서 순서대로 비나씨면 True, 아니면 False

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [19]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [20]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [21]:
# DataFrame.apply() 
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0